<html>
<head>
<title>GTChat Homepage - Frequently Asked Questions</title>
<style type="text/css">
<!--
A
{
	font-family: Verdana, Arial, Helvetica;
	text-decoration: none;
	color: #003080;
	font-weight: bold;
}
A:active
{
	color: #0060FF;
}
A:hover
{
	color: #0060FF;
	text-decoration: underline;
}
#body
{
	background-color: #E0E0E0;
	font-size: 10pt;
	color: #000000;
	font-family: Verdana, Arial, Helvetica;
}
//-->
</style>
</head>
<body id="body" marginwidth=36 leftmargin=36>

<b>Frequently Asked Questions:</b><br><br>

<a href="#server">1. Auf welchen Servern kann ich GTChat installieren?</a><br>
<a href="#traffic">2. Wie hoch ist die Chat-Traffic?</a><br>
<a href="#readme">3. Wo finde ich eine Anleitung zur Installation/Update von GTChat?</a><br>
<a href="#install">4. Ich habe alle Dateien hochgeladen, aber install.pl sagt, da&szlig; einige fehlen. Warum?</a><br>
<a href="#internal_error">5. Wenn ich chat.pl/install.pl im Browser &ouml;ffnen will, erscheint die Fehlermeldung:
500 Internal Server Error. Was ist das?</a><br>
<a href="#flock">6. Wenn ich chat.pl aufrufe, kommt die Perl-Fehlermeldung, da&szlig; flock() / crypt() nicht
implementiert sei. Woran liegt das?</a><br>
<a href="#mkfifo">7. Wenn ich mich einlogge, kommt die Fehlermeldung: &quot;Die Ausführung von mknod
oder mkfifo ist fehlgeschlagen. Bitte wenden Sie sich an den Chat-Betreiber.&quot;
Was soll ich tun?</a><br>
<a href="#login">8. Einige meiner Benutzer k&ouml;nnen sich nicht einloggen. Ist
irgendwas falsch eingestellt?</a><br>
<a href="#admin">9. Wie lautet das vordefinierte Chatmaster-Pa&szlig;wort?</a><br>
<a href="#autokick">10. Alle Benutzer werden nach einigen Minuten ausgeloggt. Aber ich
habe Autokick doch eigentlich mit autokick=0 deaktiviert?</a><br>
<a href="#pullmode">11. Sollte ich meinen Benutzern empfehlen, immer den sicheren Modus
zu verwenden?</a><br>
<a href="#superuser">12. Wie ernenne ich jemand anderes zum Superuser oder
Administrator?</a><br>
<a href="#chatmaster">13. Kann ich auch einen anderen Chatmaster bestimmen?</a><br>
<a href="#smileys">14. Wie kann ich neue Smileys einbinden bzw. die
Abk&uuml;rzungen &auml;ndern?</a><br>
<a href="#smileys2">15. Kann ich die Smileys auch auf einer anderen Seite anzeigen
lassen?</a><br>
<a href="#animation">16. Bei mir sind die Smileys nicht animiert / die
Animation stoppt, nachdem etwas geschrieben wurde. Was kann man dagegen tun?</a><br>
<a href="#colors">17. Wo &auml;ndere ich die Chat-Farben?</a><br>
<a href="#background">18. Wie kann ich ein Hintergrundbild einstellen?</a><br>
<a href="#logo">19. Kann man es so machen, da&szlig; das Logo nicht
nach 10 Sekunden verschwindet?</a><br>
<a href="#frame">20. Wie kann ich den Chat in einem Frame laufen lassen?</a><br>
<a href="#log">21. Wo finde ich das Chat-Log?</a><br>
<a href="#counter">22. Kann ich die Anzahl der Benutzer, die gerade im Chat sind, auf einer
anderen Seite anzeigen?</a><br>
<a href="#maintenance">23. Ich habe in meinen Chat den Wartungsmodus aktiviert
und kann mich nicht mehr einloggen. Was soll ich tun?</a><br>
<a href="#htaccess">24. Ich will den Chat von meinem Server l&ouml;schen, aber mein FTP-Programm
sagt immer, das Verzeichnis sei nicht leer. Woran liegt das?</a><br>

<br>

<a name="server"></a>
<i>Auf welchen Servern kann ich GTChat installieren?</i><br><br>

F&uuml;r den Austausch von Erfahrungen ist im Forum das Board 
<a href="http://www.gtchat.de/cgi-bin/YaBB/YaBB.pl?board=server">Server und Provider</a>
eingerichtet worden. Allgemein sollte man beachten, da&szlig; der
Betrieb eines Chats viele Server-Ressourcen verbraucht und deswegen
nicht selbstverst&auml;ndlich ist. Wenn die AGB des Betreibers keine
eindeutige Aussage beinhalten, sollte man <b>auf jeden Fall
nachfragen</b>.<br><br>

<a name="traffic"></a>
<i>Wie hoch ist die Chat-Traffic?</i><br><br>

Das kann man nicht allgemein sagen, das h&auml;ngt sowohl von der
Anzahl der Nutzer, als auch vom Nutzerverhalten und dem verwendeten
Chat-Modus ab. Es kann lediglich ein Erfahrungswert genannt werden, der
aber bei einem anderen Chat ganz anders aussehen kann: ein Chat mit
bis zu 30 Benutzer gleichzeitig zu Spitzenzeiten hat es auf 800 MB
monatlich gebracht. Eine Kontrolle bietet die Traffik-Statistik des
Chats, die in den allgemeinen Einstellungen aktiviert werden kann.
<br><br>

<a name="readme"></a>
<i>Wo finde ich eine Anleitung zur Installation/Update von GTChat?</i><br><br>

Die gepackte Installationsdatei von GTChat enth&auml;lt die Datei
<a href="readme_de.html">readme_de.html</a>, das ist die deutsche Anleitung.<br><br>

<a name="install"></a>
<i>Ich habe alle Dateien hochgeladen, aber install.pl sagt, da&szlig;
einige fehlen. Warum?</i><br><br>

install.pl arbeitet in einigen Sandboxumgebungen nicht korrekt, daran
wird noch gearbeitet. Die Einstellungen kann man auch per Hand vornehmen:
man stellt die Zugriffsrechte f&uuml;r alle Dateien im
CGI-Verzeichnis des Chats (auch in den Unterverzeichnissen) bis auf
chat.pl auf 666 (lesen und schreiben f&uuml;r alle), f&uuml;r chat.pl
und die Verzeichnisse auf 777 (lesen, schreiben und ausf&uuml;hren
f&uuml;r alle). Dann mu&szlig; man noch in Directories.dat
die Verzeichnisse/URLs &auml;ndern.<br><br>

<a name="internal_error"></a>
<i>Wenn ich chat.pl/install.pl im Browser &ouml;ffnen will, erscheint die Fehlermeldung:
500 Internal Server Error. Was ist das?</i><br><br>

Diese Fehlermeldung kann leider fast alles bedeuten. H&auml;ufigste Ursachen
sind: falsche Zugriffsrechte (chat.pl und install.pl m&uuml;ssen
ausf&uuml;hrbar sein), falscher Perl-Pfad (mu&szlig; in der ersten Zeile
des Programms korrigiert werden), Datei wurde mit einem Windows-Editor bearbeitet
und enth&auml;lt nun Windows-Zeilenumbr&uuml;che (entweder anderen Editor
verwenden oder im ASCII-Modus hochladen), Dateierweiterung pl auf dem
Server nicht zul&auml;ssig (chat.pl in chat.cgi umbenennen). Wenn diese
Problemursachen ausgeschlossen sind, hilft oft nur noch der Blick in das
Fehler-Log des Servers, wo dann die eigentliche Fehlermeldung steht.<br><br>

<a name="flock"></a>
<i>Wenn ich chat.pl aufrufe, kommt die Perl-Fehlermeldung, da&szlig;
flock() / crypt() nicht implementiert sei. Woran liegt das?</i><br><br>

Die aktuelle Chat-Version ist nicht unter Windows lauff&auml;hig.
Es wird daran gearbeitet.<br><br>

<a name="mkfifo"></a>
<i>Wenn ich mich einlogge, kommt die Fehlermeldung: &quot;Die Ausführung von mknod
oder mkfifo ist fehlgeschlagen. Bitte wenden Sie sich an den Chat-Betreiber.&quot;
Was soll ich tun?</i><br><br>

GTChat ist bei dem Versuch, eine FIFO zu erstellen, gescheitert.
Diese ist f&uuml;r den Betrieb im Server-Push-Modus aber notwendig.
Möglicherweise konnten lediglich die Parameter nicht ermittelt werden.
Loggen Sie sich im Client-Pull-Modus (&quot;sicherer Modus&quot;)
ein, gehen Sie unter Admin / Allgemeine Einstellungen, deaktivieren
Sie dort externen mknod und stellen Sie SYS_mknod = 14 und
S_IFIFO = 4096 ein. Diese Werte funktionieren auf den meisten
Unix-Systemen. Alternativ kann man sich erkundigen, wo auf dem
Server das Programm mknod oder mkfifo zu finden ist (nur eines
von beiden n&ouml;tig), und die Pfade &auml;ndern.<br><br>

<a name="login"></a>
<i>Einige meiner Benutzer k&ouml;nnen sich nicht einloggen. Ist
irgendwas falsch eingestellt?</i><br><br>

Nein, solche Probleme werden normalerweise von den Proxy-Servern
der Benutzer verursacht. Man kann es testen, indem man sich im
Client-Pull-Modus einloggt (beim Login &quot;sicherer Modus&quot;
ankreuzen), da sollte es keine Probleme mehr geben. Eine detailiertere
Beschreibung findet sich in der Chat-Hilfe.<br><br>

<a name="admin"></a>
<i>Wie lautet das vordefinierte Chatmaster-Pa&szlig;wort?</i><br><br>

Standardm&auml;&szlig;ig ist ein Chatmaster-Account mit Benutzername
admin und Pa&szlig;wort admin eingerichtet. Auf einigen Servern
k&ouml;nnte dieses Pa&szlig;wort aber nicht funktionieren, weil das
Verschl&uuml;sselungsverfahren anders ist. F&uuml;r diese F&auml;lle
gibt es im Addon-Bereich das Tool &quot;Pa&szlig;wort&auml;nderung
f&uuml;r Chatmaster&quot;.<br><br>

<a name="autokick"></a>
<i>Alle Benutzer werden nach einigen Minuten ausgeloggt. Aber ich
habe Autokick doch eigentlich mit autokick=0 deaktiviert?</i><br><br>

Das Problem hier ist nicht der Autokick (bei diesem gibt es immer
eine Meldung, au&szlig;erdem werden nur inaktive Benutzer gekickt),
sondern ein Server-Timeout (z.B. bei f2s aktiv).
Server Push ben&ouml;tigt einen aktiven Prozess auf dem Server,
dieser wird aber nach einigen Minuten beendet. Zu empfehlen w&auml;re
der ausschlie&szlig;liche Einsatz vom Client-Pull-Modus
(unter Admin / Allgemeine Einstellungen &quot;Nur sicheren Modus erlauben&quot;
aktivieren).<br><br>

<a name="pullmode"></a>
<i>Sollte ich meinen Benutzern empfehlen, immer den sicheren Modus
zu verwenden?</i><br><br>

Solange es auch anders geht, sollte man es nicht tun. Nachteile von
diesem Modus sind gr&ouml;&szlig;ere Verz&ouml;gerungen und eine
etwas h&ouml;here Traffic. Eine Untersuchung der Serverbelastung
nach den &Auml;nderungen in GTChat 0.93 steht noch aus.<br><br>

<a name="superuser"></a>
<i>Wie ernenne ich jemand anderes zum Superuser oder
Administrator?</i><br><br>

Dazu mu&szlig; man sich als Chatmaster einloggen und das Profil des
Benutzers bearbeiten (z.B. auf den Namen in der Liste klicken und
dort auf &quot;Profil bearbeiten&quot;). Dann kann man den Status des
Benutzers &auml;ndern.<br><br>

<a name="chatmaster"></a>
<i>Kann ich auch einen anderen Chatmaster bestimmen?</i><br><br>

Das Sicherheitskonzept sieht nur einen Chatmaster vor.
Allerdings kann man unter Admin / Zugriffsrechte bearbeiten
anderen Benutzergruppen gr&ouml;&szlig;ere Befugnisse erteilen.<br><br>

<a name="smileys"></a>
<i>Wie kann ich neue Smileys einbinden bzw. die
Abk&uuml;rzungen &auml;ndern?</i><br><br>

Die M&ouml;glichkeiten daf&uuml;r befinden sich unter Admin / Smileys
bearbeiten. Man kann einige Smileys auch &quot;unsichtbar&quot; machen,
so da&szlig; sie zwar nicht in der Auswahl angezeigt, aber trotzdem
umgewandelt werden.<br><br>

<a name="smileys2"></a>
<i>Kann ich die Smileys auch auf einer anderen Seite anzeigen
lassen?</i><br><br>

Ja, dann braucht man nur die Marke {SMILEYS} aus dem Template input.html
l&ouml;schen und irgendwo einen Link auf die neue Seite anbringen
(z.B. im Template options.html). Man kann es auch so machen, da&szlig;
beim Anklicken eines Smileys dieser in die Eingabeleiste eingef&uuml;gt
wird (Thread
<a href="http://www.gtchat.de/cgi-bin/YaBB/YaBB.pl?board=general&action=display&num=1145">Smileys!</a>
im Forum).<br><br>

<a name="animation"></a>
<i>Bei mir sind die Smileys nicht animiert / die Animation stoppt, nachdem
etwas geschrieben wurde. Was kann man dagegen tun?</i><br><br>

Nichts, au&szlig;er sich einen anderen Browser installieren. Bei
Netscape und zum Teil bei Internet Explorer 5.0 geht es nicht
anders.<br><br>

<a name="colors"></a>
<i>Wo &auml;ndere ich die Chat-Farben?</i><br><br>

Alle Farben werden in der Datei style.css eingestellt. Eine
Beschreibung der Funktionen der einzelnen CSS-Klassen findet sich
in der Datei <a href="readme_de.html">readme_de.html</a>.<br><br>

<a name="background"></a>
<i>Wie kann ich ein Hintergrundbild einstellen?</i><br><br>

Wenn ein Hintergrundbild f&uuml;r den gesamten Chat eingestellt
werden soll, kann man in style.css die Zeile
&quot;background-image:url(image.gif);" zu der Klasse #body
hinzuf&uuml;gen. Ansonsten bedient man sich der &uuml;blichen
HTML-Methoden bei den einzelnen Templates.<br><br>

<a name="logo"></a>
<i>Kann man es so machen, da&szlig; das Logo nicht
nach 10 Sekunden verschwindet?</i><br><br>

Man mu&szlig; im Template chat.html ein neues Frame extra f&uuml;r
das Logo einf&uuml;gen. Dann kann man in chat.js roomlistdelay=0
setzen, weil die Raumliste nicht mehr zeitverz&ouml;gert zu
erscheinen braucht.<br><br>

<a name="frame"></a>
<i>Wie kann ich den Chat in einem Frame laufen lassen?</i><br><br>

Mit den Standard-Templates startet der Chat immer im gesamten Fenster,
um mehr Platz zu haben. Wenn man das &auml;ndern will, mu&szlig; man
in den Templates login.html und register_success.html beim FORM-Tag
target=&quot;_top&quot; entfernen. Ersetzt man das durch
target=&quot;_blank&quot;, wird der Chat immer in einem neuen Fenster
ausgef&uuml;hrt.<br><br>

<a name="log"></a>
<i>Wo finde ich das Chat-Log?</i><br><br>

Das Chat-Log befindet sich in der Datei Variables/log.txt. Leider
ist es in der aktuellen Chat-Version noch nicht m&ouml;glich, die
gespeicherten Texte aus dem Chat im HTML-Format zu betrachten.<br><br>

<a name="counter"></a>
<i>Kann ich die Anzahl der Benutzer, die gerade im Chat sind, auf einer
anderen Seite anzeigen?</i><br><br>

Ja, daf&uuml;r gibt es im Addon-Bereich mehrere L&ouml;sungen, unter
anderem eine, die auch die Namen der Benutzer ausgibt.<br><br>

<a name="maintenance"></a>
<i>Ich habe in meinen Chat den Wartungsmodus aktiviert
und kann mich nicht mehr einloggen. Was soll ich tun?</i><br><br>

Man mu&szlig; in der Datei Settings.dat $maintenance=0 statt 1
setzen, dann ist der Wartungsmodus wieder beendet.<br><br>

<a name="htaccess"></a>
<i>Ich will den Chat von meinem Server l&ouml;schen, aber mein FTP-Programm
sagt immer, das Verzeichnis sei nicht leer. Woran liegt das?</i><br><br>

Das liegt meistens an den .htaccess-Dateien, die der FTP-Server nicht
anzeigt. Deswegen kann das FTP-Programm die Datei nicht l&ouml;schen. Die
meisten FTP-Programme haben eine M&ouml;glichkeit, einen Befehl direkt an den
Server zu senden (z.B. m&uuml;&szlig;te man den im Windows Commander einfach
in der Befehlszeile eintippen). Der Befehl zum L&ouml;schen der .htaccess-Datei
w&auml;re &quot;DELE .htaccess&quot; (im Verzeichnis, das sich nicht l&ouml;schen
l&auml;&szlig;t).<br><br>

</body>
</html> 
