<html>
<head>
<link rel="stylesheet" href="style.css">
<title>Private Chat - Frequenty Asked Questions</title>
</head>
<body id="body" marginwidth=36 leftmargin=36>

<div align="center">
	<br>
	<img src="/images/hier_vielleicht_ihr_Logo_einfuegen.gif" border=0>
	<br><br><br>
</div>


<table border=0 width=100% cellspacing=0 id="lines"><tr><td>  <!-- Netscape compatibility -->

<table border=0 width=100% cellspacing=1>
<tr>
	<th>Chat-Hilfe</th>
</tr>
<tr id="table2">
	<td><table>
		<tr><td><a href="commands.html#commands">&Uuml;bersicht der Befehle</a></td></tr>
		<tr><td><a href="faq.html#faq">Frequently Asked Questions</a></td></tr>
		<tr><td>&nbsp;&nbsp;&nbsp;&nbsp;<a href="faq.html#username">Benutzername/Nickname</a></td></tr>
		<tr><td>&nbsp;&nbsp;&nbsp;&nbsp;<a href="faq.html#problem">Das Chat l&auml;uft nicht!</a></td></tr>
		<tr><td>&nbsp;&nbsp;&nbsp;&nbsp;<a href="faq.html#usage">Chatbenutzung</a></td></tr>
		<tr><td>&nbsp;&nbsp;&nbsp;&nbsp;<a href="faq.html#admins">Administratoren</a></td></tr>
	</table></td>
</tr>
</table>

</td></tr></table>	<!-- Netscape compatibility -->
<br><br>

<a name="faq"></a>
<table>
<tr>
	<td colspan=2 id="bigheadertext"><b>Frequently Asked Questions</b><td>
</tr>
</table>



<a name="username"></a>
<table>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td colspan=2 id=headertext><b>Benutzername/Nickname</b><td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>

<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Wenn ich mich einlogge kommt die Meldung "Benutzername existiert nicht".
		Hat man meinen Namen gel&ouml;scht?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Die Accounts vom alten Chat konnten nicht &uuml;bernommen werden. Wenn Sie sich
		also noch nicht in diesem Chat registriert haben, sollten Sie das tun. Wenn
		Sie bereits registriert sind, sollten Sie beachten, da&szlig; man beim Login den
		Benutzernamen und nicht den Nick angeben mu&szlig;.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Ich will mich nicht registrieren. Wie kriege ich trotzdem einen normalen Namen
		anstatt Gast123?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Sie k&ouml;nnen beim Einloggen einen Namen angeben. Wenn Sie kein Pa&szlig;wort eingeben,
		kommen Sie als Gast mit diesem Namen rein und m&uuml;ssen sich nicht registrieren.
		Alternativ kann man nach dem Einloggen den Namen wechseln, indem man <tt>/nick name</tt>
		eintippt.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Es hat sich bereits jemand mit meinem Nickname angemeldet. Was kann ich tun?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Nichts. Es kommt regelm&auml;&szlig;ig vor, da&szlig; mehrere Leute denselben Nick bevorzugen.
		Wer sich zuerst im Chat anmeldet, kann ihn dort benutzen. Denken Sie sich einen
		anderen Namen aus. Zuerst sollten Sie aber vielleicht &uuml;berpr&uuml;fen, ob es nicht
		Ihr eigener Account ist, den Sie blo&szlig; vergessen haben.
	</td>
</tr>
</table>



<a name="problem"></a>
<table>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td colspan=2 id=headertext><b>Der Chat l&auml;uft nicht!</b><td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>

<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Mit welchen Browsern funktioniert der Chat?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Der Chat läuft mit Netscape 4.x und höher sowie
		Internet Explorer 5.x und höher. Internet Explorer
		4.x sollte auch gehen, allerdings lie&szlig; sich
		niemand finden, der diesen Browser verwendet
		(verst&auml;ndlich).
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Mein Browser ist in der Liste oben aufgef&uuml;hrt, aber wenn ich mich einlogge,
		sehe ich nur eine leere Seite mit dem Logo dr&uuml;ber. Weder das Eingabefeld
		noch die Benutzerliste erscheinen. Woran liegt das?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Wahrscheinlich ist in Ihrem Browser JavaScript deaktiviert.<br>
		<b>Im Internet Explorer</b> aktiviert man JavaScript wie folgt: Extras / Internetoptionen,
		dort auf Sicherheit und Stufe anpassen klicken. In dem Fenster dann
		Scripting - Active Scripting - Activieren anw&auml;hlen.<br>
		<b>Im Netscape</b>: Bearbeiten / Einstellungen und dort auf Erweitert gehen.
		JavaScript aktivieren anw&auml;hlen (englische Version: Edit / Preferences /
		Advanced / Enable JavaScript).<br>
		Andere M&ouml;glichkeit: Sie benutzen den sicheren Modus mit Netscape. Dabei
		tritt manchmal dieser Browser-Bug auf. Dr&uuml;cken Sie auf Neu Laden (bzw. Refresh),
		es m&uuml;&szlig;te dann funktionieren.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Mein Browser ist in der Liste oben aufgef&uuml;hrt, aber wenn ich mich einlogge,
		dann sehe ich nur ein wei&szlig;es (Netscape: graues) Rechteck.
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Das liegt wahrscheinlich an einer fehlerhaften Proxy-Konfiguration.
		Proxy-Einstellungen deaktivieren sollte in den meisten F&auml;llen helfen.<br>
		<b>Im Internet Explorer</b> macht man das wie folgt: Extras / Internetoptionen,
		dort auf Verbindungen und LAN-Einstellungen klicken. &quot;Proxyserver
		verwenden&quot; sollte nicht angekreuzt sein.<br>
		<b>Im Netscape</b>: Bearbeiten / Einstellungen, dort in
		Erweitert den Unterpunkt Proxies ausw&auml;hlen und &quot;Direkte Verbidung zum
		Internet&quot; anw&auml;hlen (Englische Version: Edit / Preferences / Advanced /
		Proxies / Direct connection to the Internet).<br>
		Wenn das nicht hilft, kann man den Chat nur im sicheren Modus verwenden
		(beim Einloggen ankreuzen).
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Ich kann den Chat mit der AOL-Software nicht benutzen.
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Die eingestellten Proxy-Server erlauben keinen Betrieb im
		normalen Chat-Modus. Leider kann man diese Einstellungen
		in der AOL-Software nicht &auml;ndern. Versuchen Sie, einen
		externen Browser (Internet Explorer oder Netscape) und
		deaktivieren Sie dort die Proxy-Server (Anleitung siehe
		oben). Sollte das auch nicht funktionieren, w&auml;hlen Sie beim
		Einloggen stets den sicheren Modus.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Ich kann mich problemlos einloggen, aber nach einigen Minuten kommt immer
		eine Fehlermeldung (irgendwas von "Serververbindung zur&uuml;ckgesetzt" im
		Internet Explorer) und ich bin raus, mu&szlig; mich neu einloggen.
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		In diesem Fall hei&szlig;t Ihr Internet-Provider h&ouml;chstwahrscheinlich Mannesmann
		Arcor. Dieser Provider ist anscheinend der Meinung, da&szlig; man eine
		Serververbindung h&ouml;chstens f&uuml;nf Minuten lang brauchen kann, und hat seine
		Proxy-Server entsprechend konfiguriert. Jede Verbindung wird nach einigen
		Minuten getrennt, unabh&auml;ngig davon, ob noch Daten &uuml;bertragen werden. <br>
		Der Chat kann dennoch problemlos im sicheren Modus benutzt werden (beim
		Einloggen ankreuzen).
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Ich war am Chatten, aber pl&ouml;tzlich kommt nichts mehr, auch meine eigenen
		Beitr&auml;ge nicht. Wenn ich auf Logout klicke, passiert auch nichts.
		Was ist passiert?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Damit der Chat funktioniert, mu&szlig; die Verbindung zum Server bestehen bleiben.
		Wenn Sie auf Escape dr&uuml;cken oder auf Abbrechen (bzw. Stop) klicken, bricht
		der Browser die Verbindung ab. Beim Netscape erkennt man das an dem Text
		"&Uuml;bertragung abgebrochen", Internet Explorer zeigt nichts an. Klicken Sie
		auf Aktualisieren (bzw. Neu laden) und best&auml;tigen Sie, da&szlig; die Daten nochmal
		gesendet werden.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Ich versuche, mich mit meinem Internet Explorer einzuloggen, sehe aber nur
		ein wei&szlig;es Fenster.
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Sind Sie in einem anderen Browser-Fenster schon eingeloggt? Einschr&auml;nkungen
		des Internet Explorers erlauben es nicht, da&szlig; der Chat in zwei Fenstern
		gleichzeitig l&auml;uft.
	</td>
</tr>
</table>



<a name="usage"></a>
<table>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td colspan=2 id=headertext><b>Chatbenutzung</b><td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>

<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Wie &auml;ndere ich meine Farbe?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Die Farbe kann mit dem /color-Befehl ge&auml;ndert werden oder, einfacher,
		im Profil. Dort k&ouml;nnen Sie eine Standardfarbe aus der Palette ausw&auml;hlen
		oder aus Rot-, Gr&uuml;n- und Blauanteilen (0 bis 255 sind erlaubt) zusammenmischen.
		Im Internet Explorer k&ouml;nnen Sie an der Textfarbe im Farbe-Eingabefeld
		sehe, welche Farbe Sie gerade haben.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Wie mache ich das, da&szlig; bei meiner Nachricht &quot;(zu irgendwer)&quot;
		steht?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Schreiben Sie vor ihrem Text <tt>irgendwer:</tt>, alternativ geht auch
		<tt>@irgendwer</tt>.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Wie mache ich, da&szlig; mein Text fett/kursiv dargestellt wird?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Wenn man <tt>_text_</tt> schreibt, wird der Text fettgedruckt.
		Genauso kann man <tt>*text*</tt> schreiben, dann wird er kursiv
		dargestellt.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Wie verschicke ich Privatnachrichten?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Dazu kann man im Eingabefeld <tt>/msg irgendwer text</tt> eintippen.
		Wem das zu kompliziert ist: man kann auf einen Namen in der Benutzerliste
		klicken. Es erscheint ein Fenster, in dem neben einigen Benutzerinformationen
		ein Eingabefeld f&uuml;r Privatnachrichten zu finden ist.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Wie zeige ich an, da&szlig; ich weg bzw. wieder da bin?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Tippen Sie den Befehl <tt>/away</tt> ein. Optional k&ouml;nnen Sie einen
		Grund dahinter angeben. Wenn Sie wieder da sind, schreiben Sie einfach
		etwas, dann wird es angezeigt.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Bei vielen Sachen mu&szlig; man den Nickname angeben. Aber wenn der lang ist,
		mu&szlig; ich den trotzdem komplett eintippen?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Nein. Es reicht, den Anfang des Namens anzugeben, der Rest wird automatisch
		erg&auml;nzt. Das klappt allerdings nicht, wenn mehrere Namen so anfangen.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Die animierten Smileys st&ouml;ren mich, kann man sie nicht abschalten?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Man kann den Befehl <tt>/smileys off</tt> eintippen oder im Profil das
		H&auml;ckchen bei &quot;Smileys verwenden&quot; entfernen. Danach wird keine
		Smiley-Auswahl mehr angezeigt und auch die Smileys, die andere Chatter
		schreiben, werden nicht in Bilder umgewandelt. Mit <tt>/smileys on</tt>
		l&auml;&szlig;t es sich wieder r&uuml;ckg&auml;ngig machen.
	</td>
</tr>
</table>



<a name="admins"></a>
<table>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td colspan=2 id=headertext><b>Administratoren</b><td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>

<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Was kann ein Administrator?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Die Rechte eines Administrators beziehen sich haupts&auml;chlich
		auf die Verwaltung des Chats. Wenn allerdings jemand andere
		bel&auml;stigt oder beleidigt, kann der Administrator ihm f&uuml;r einige
		Zeit das Reden verbieten oder ihn aus dem Chat schmei&szlig;en. In
		extremen F&auml;llen kann derjenige sogar dauerhaft vom Chat
		ausgeschlossen werden.
	</td>
</tr>
<tr><td colspan=2>&nbsp;</td></tr>
<tr>
	<td valign=top id=headertext>Frage:</td>
	<td id=headertext>
		Werden die Unterhaltungen gespeichert?
	</td>
</tr>
<tr>
	<td valign=top id=headertext>Antwort:</td>
	<td id=headertext>
		Ja, aus Sicherheitsgr&uuml;nden werden alle &ouml;ffentlichen Unterhaltungen einige Zeit
		aufbewahrt. Falls also etwas vorgefallen ist, k&ouml;nnen es sich die Administratoren
		anschauen. Je nach Einstellungen des Chats k&ouml;nnen auch Privatnachrichten gespeichert
		werden.
	</td>
</tr>
</table>

</body>
</html> 